rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Jasmine'
---
  def director
    @movie = Movie.find(params[:movie_id])
    if @movie.director.blank? == true